src/cf/Catalogs/пбп_НастройкиОтбораОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пбп_НастройкиОтбораОбъектов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/пбп_НастройкиОтбораОбъектов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновщик();
	
	Если Не ПустаяСтрока(Объект.Отбор) Тогда
		
		ОтборКомпоновки = пбп_Переадресация.ЗначениеИзСтрокиXML(Объект.Отбор);
		Компоновщик.Настройки.Отбор.Элементы.Очистить();
		Справочники.пбп_НастройкиОтбораОбъектов.СкопироватьЭлементыОтбора(Компоновщик.Настройки.Отбор, ОтборКомпоновки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Отбор = пбп_Переадресация.ЗначениеВСтрокуXML(Компоновщик.Настройки.Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОперации", "ВыборОбъекта");
	ПараметрыФормы.Вставить("ВыводитьТЧОбъектов", Истина);
	ПараметрыФормы.Вставить("ТекущийОбъект", Объект.ОбъектМетаданных);
	ПараметрыФормы.Вставить("ТипТекущегоОбъекта", Объект.ТипОбъекта);
	
	СписокКоллекций = Новый СписокЗначений;
	// Формируем список коллекций объектов
	СписокКоллекций.Добавить("Справочники");
	СписокКоллекций.Добавить("Документы");
	СписокКоллекций.Добавить("ПланыВидовХарактеристик");
	СписокКоллекций.Добавить("ПланыСчетов");
	СписокКоллекций.Добавить("ПланыВидовРасчета");
	
	ПараметрыФормы.Вставить("СписокКоллекций", СписокКоллекций);
	
	ОткрытьФорму("Справочник.пбп_НастройкиОтбораОбъектов.Форма.ФормаВыбораОбъектаМетаданных", ПараметрыФормы, Элементы.ОбъектМетаданных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДанныеФормыЭлементДерева") Тогда
		
		Объект.ОбъектМетаданных = ВыбранноеЗначение.ТипЗначения + "." + ВыбранноеЗначение.ИдентификаторПоля;
		
		Модифицированность = Истина;
		
		ИнициализироватьКомпоновщик();
		
		Элементы.КомпоновщикНастройкиОтбор.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьКомпоновщик()
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) Тогда
		Справочники.пбп_НастройкиОтбораОбъектов.ИнициализироватьКомпоновщик(Компоновщик, Объект.ОбъектМетаданных);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
